document.addEventListener("DOMContentLoaded", () => {
  const generateBtn = document.getElementById("generateBtn");
  const cardContainer = document.getElementById("cardContainer");

  generateBtn.addEventListener("click", generateScene);

  const characters = [
    "Гоава", "Аен", "Незу", "Сеснай", "Амиак", "Дедус", "Шаен", "Зерг", "Бибрик", "Виталий", "Сугавара", "Маха", "Доин паладин", "Ларгон", "Рептар", "Дюр-Сан", "Трон", "Клеви", "Челик", "Пират", "Коул"
  ];

  const reasons = [
    "Костюм горничной", "Костюм фембоя", "Костюм томбоя", "Фартук на голое тело", "Японская форма школьницы", "В костюме фреди", "Ниточки", "Батины панталоны", "Семейники", "Пикми костюмчик", "Нефорская одежда", "Косплей Мику", "В одежде ситха", "В одежде джедая", "Торифокс стайл", "Строгая секретарша", "Медсестра", "Гейша", "Одежда викторианской эпохи", "Одежда каменного века", "Клоун", "Лолита", "В костюме май литл пони", "В одежде Нагито Камаеде", "В костюме Монокумы", "в твоей одежде что сейчас на тебе", "Мужская длинная рубашка", "Латексный костюм", "В ошейнике и в трусах с сердчеками", "Костюм оленя", "В костюме повара", "В стиле римской империи", "В костюме кочевника", "Бодиарт и шорты", "Египетский стиль", "Греческий стиль", "Костюм гладиатора", "Военная форма", "В одежде любого персонажа из геншина", "В стрипах и латексе", "Полицейская форма", "Костюм Соды", "Костюм любого вокалоида", "Костюм Вампира", "Яндере стайл", "Костюм любой втуберши, втубера", "Костюм Пуджа", "В покрывале", "В полотенце", "Амазонка", "Строгий костюм"
  ];

  const locations = [
    "Изгиб Пин-ап", "Облокотилися об что-то", "Наклон вперёд с опорой", "Поза доминанта", "На полу потянув колено", "Повис", "Сидя на колене", "Подвис на краю", "Кошпчья поза", "Полулёжа", "На животе", "Спиной к зрителю", "Попрпавляет причёску", "С книгой у груди", "Ладони в сердечко", "Мое поза", "Снимает обувь", "На корточках", "Обняв колени", "Поза Синдзи", "Утренняя потягушка", "Ангел на снегу"
  ];

  const angles = [
    "Спальня", "Гостиная", "Кухня", "Ванна", "Кабинет", "На крыше", "В лесу", "На мосту", "Чердак", "Подвал", "Бассейн из ромпы первой", "Лифт", "Классный суд", "Детективное бюро Райт и Ко", "В туалете", "Таверна", "Пещера дракона", "Бар", "Трущёбы", "Дом орка в болоте", "Грибной лес", "Рынок", "Пузырьковая равнина", "Монотонный фон", "Затопленный город", "На вершине горы"
 
  ];

  function getRandom(arr) {
    return arr[Math.floor(Math.random() * arr.length)];
  }

  function generateScene() {
    cardContainer.innerHTML = "";

    const stages = [
      { title: "Жертва из хай стаффа", content: `${getRandom(characters)}` },
      { title: "Одежда", content: getRandom(reasons) },
      { title: "Поза", content: getRandom(locations) },
      { title: "Фон", content: getRandom(angles) }
    ];

    stages.forEach(stage => {
      const card = document.createElement("div");
      card.className = "card";
      card.innerHTML = `<h3>${stage.title}</h3><p>${stage.content}</p>`;
      cardContainer.appendChild(card);
    });
  }
});
